# CustomDataExists Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..CustomDataExists Method
FabricationConfiguration Class See Also
---
Checks to see if the specified custom data exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CustomDataExists(
	int customDataId
)
```

Visual Basic
---
```text
Public Function CustomDataExists ( _
	customDataId As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CustomDataExists(
	int customDataId
)
```

# ### Parameters
customDataId
    Type: System..::..Int32 The custom data identifier.
# ### Return Value
Returns true if the custom data exists.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace